tests/load/api-perf.yml
# Artillery load test — CXO Event Companion API
#
# Tests the four endpoints that slowed under real event load:
#   - Attendee list (audience tab)
#   - Survey list (engage tab)
#   - Poll list (engage tab)
#   - Event listing (home / event picker)
#
# Prerequisites
# -------------
# 1. Set LOAD_TEST_TOKEN to a valid Bearer token.
# 2. Set LOAD_TEST_EVENT_ID to the numeric event id to test against (e.g. 21).
# 3. Optionally set LOAD_TEST_BASE_URL (defaults to https://app.cxocollaborate.com).
#
# Run
# ---
#   export LOAD_TEST_TOKEN="<token>"
#   export LOAD_TEST_EVENT_ID=21
#   npm run test:load

config:
  # Default target is production. Override via:
  #   artillery run --target https://staging.cxocollaborate.com tests/load/api-perf.yml
  target: "https://app.cxocollaborate.com"
  http:
    timeout: 15
    pool: 50
  defaults:
    headers:
      Authorization: "Bearer {{ $processEnvironment.LOAD_TEST_TOKEN }}"
      X-Tenant-ID: "3"
      Accept: "application/json"

  # Ramp from 0 → 100 virtual users over 30 s, hold 60 s, ramp down 15 s.
  phases:
    - name: "ramp-up"
      duration: 30
      arrivalRate: 1
      rampTo: 100
    - name: "sustained-load"
      duration: 60
      arrivalRate: 100
    - name: "ramp-down"
      duration: 15
      arrivalRate: 100
      rampTo: 1

  # Fail the suite if p95 latency > 3 s or error rate > 1 %
  ensure:
    maxErrorRate: 1
    thresholds:
      - http.response_time.p95: 3000

scenarios:
  # ── Audience list ──────────────────────────────────────────────────────────
  # Previously had staleTime:0 on the client — every tab switch by every user
  # fired a fresh GET with zero coalescing. Now staleTime:60s.
  - name: "GET attendees"
    weight: 30
    flow:
      - get:
          url: "/api/v1/events/{{ $processEnvironment.LOAD_TEST_EVENT_ID }}/attendees"
          expect:
            - statusCode: 200

  # ── Survey list ────────────────────────────────────────────────────────────
  # Client previously auto-prefetched 10 detail pages per mount (→ 11 req/user).
  # Prefetch is now capped at 3 on mount; remaining pages load on demand.
  - name: "GET surveys"
    weight: 20
    flow:
      - get:
          url: "/api/v1/events/{{ $processEnvironment.LOAD_TEST_EVENT_ID }}/mobile-surveys"
          expect:
            - statusCode: 200

  # ── Poll list ──────────────────────────────────────────────────────────────
  # Previously used React Query's default staleTime:0 — refetched on every focus.
  # Now staleTime:60s matches the audience cache window.
  - name: "GET polls"
    weight: 25
    flow:
      - get:
          url: "/api/v1/events/{{ $processEnvironment.LOAD_TEST_EVENT_ID }}/mobile-polls"
          expect:
            - statusCode: 200

  # ── Event listing ──────────────────────────────────────────────────────────
  - name: "GET events"
    weight: 25
    flow:
      - get:
          url: "/api/v1/tenants/3/events"
          expect:
            - statusCode:
                - 200
                - 404